 {"description" : "The Steampunk Manticore - Grease Monkey - is a legendary engineer, known for its uncanny ability to repair and maintain complex machinery. It has the agility of a manticore and the intellect of an engineer. It uses steam power in its attacks.","name" : "Grease Monkey","power" : 35,"toughness" : 40,"speed" : 15,"energy" : 25,"monster_types" : "Steampunk Manticore Engineer","weakness" : "Electromagnetic Pulse","immunity" : "Fire","seed" : "Steampunk Manticore Engineer"}
 {"description" : "The Ghost Pirate Captain is a spectral figure leading his crew of ghostly pirates on the high seas. He and his crew can pass through walls and leave behind a trail of fear, causing panic in nearby creatures.",    "name" : "Captain Fearbeard",    "power" : 25,    "toughness" : 18,    "speed" : 20,    "energy" : 22,    "monster_types" : "Ghost Pirate",    "weakness" : "Blessed Relics",    "immunity" : "Fire",    "seed" : "Ghost Pirate Captain"    }
 {"description" : "The Glowing Slime Alchemist is a unique and valuable addition to any lab or research facility. It can produce an array of chemicals and elixirs, but be careful not to disturb it while it's working as it may release harmful substances. Its slimy touch can also be used for healing.",     "power" : 5,     "toughness" : 3,     "speed" : 1,     "energy" : 7,     "monster_types" : "Slime Alchemist",     "weakness" : "Fire",     "immunity" : "Cold",     "seed" : "Glowing Slime Alchemist"     }
 {"description" : "A 24-volt Electric Eel Samurai is a formidable adversary, both in the water and on land. With its powerful eel tail, it delivers electric shocks to immobilize its enemies. Clad in full samurai armor, it wields a katana charged with electricity, dealing extra damage.",     "power" : 35,     "toughness" : 18,     "speed" : 20,     "energy" : 15,     "monster_types" : "Electric Eel Samurai",     "weakness" : "Fire",     "seed" : "24. Electric Eel Samurai"    }
 {"description" : "A skeletal archer, armed with a longbow and quiver full of arrows.",    "power" : 3,    "toughness" : 1,    "speed" : 3,    "energy" : 0,    "monster_types" : "Undead",    "weakness" : "Electricity",    "seed" : "Skeleton Archer"    }
 {"description" : "The Shadowy Phantom Bard is a mysterious and elusive creature, often found haunting abandoned theaters and performance halls. It can manipulate shadows to create illusions and confuse its enemies. Its music is said to bring melancholy to the hearts of those who hear it.",    "power" : 15,    "toughness" : 6,    "speed" : 12,    "energy" : 10,    "monster_types" : "Shadowy Phantom",    "weakness" : "Bright Light",    "immunity" : "Sound Silence",    "seed" : "Shadowy Phantom Bard",    "name" : "The Unnamed Bard of Shadows"    }
 {"description" : "The Spider Queen Weaver is a legendary arachnid monarch, weaving intricate webs and commanding her minions. She lays eggs that hatch into powerful spiders.","name" : "Spider Queen Weaver","power" : 75,"toughness" : 90,"speed" : 12,"energy" : 60,"monster_types" : "Spider Queen","weakness" : "Fire","immunity" : "Poison and Paralysis","seed" : "Spider Queen Weaver"}
 {"description" : "The Giant Crab Sage is a wise and ancient crustacean who dwells in the depths of the ocean. He imparts his knowledge of the sea to young crabs, and has the ability to manipulate water currents and create tidal waves.",    "power" : 35,    "toughness" : 60,    "speed" : 7,    "energy" : 20,    "monster_types" : "Crab",    "weakness" : "Fire",    "immunity" : "Ice and Rock",    "seed" : "Giant Crab Sage"    }
 {"description" : "A colossal golem made entirely of meteoritic metal, it crashes through its surroundings with brute force.",     "power" : 81,     "toughness" : 95,     "speed" : 3,     "energy" : 0,     "monster_types" : "Golem",     "weakness" : "Water",     "immunity" : "Poison and Radiation",     "seed" : "Meteorite Golem"     }
 {"description" : "The Plague Doctor is a shrouded figure in a long robe and mask, known to bring devastating plagues to entire lands. Its breath can spread diseases, its touch contaminates, and it's immune to most debuffs.",    "power" : 15,    "toughness" : 35,    "speed" : 8,    "energy" : 10,    "monster_types" : "Plague Bringer",    "weakness" : "Fire",    "immunity" : "Poison and Debuffs",    "seed" : "Plague Doctor"    }
 {"description" : "The Starfish Wizard is an otherworldly magician that dwells deep in the ocean. It's covered in shimmering starfish scales, and it uses its psychic abilities to manipulate water currents, creating whirlpools and tidal waves.","power" : 54,"toughness" : 32,"speed" : 8,"energy" : 31,"monster_types" : "Starfish","weakness" : "Fire","immunity" : "Mind Control and Temptation","seed" : "Starfish Wizard"}
 {"description" : "A towering, armored Mechanical T-Rex Knight, wielding a massive steel weapon. It moves with a grace and precision that belies its immense size.",     "power" : 75,     "toughness" : 100,     "speed" : 6,     "energy" : 30,     "monster_types" : "Mechanical Dinosaur Knight",     "weakness" : "Fire",     "immunity" : "Poison and Paralysis",     "seed" : "Mechanical T-Rex Knight"    }
 {"description" : "The Spectral Horseman is a terrifying undead warrior, riding on a spectral steed. It wields a ghostly lance and is known to haunt the battlefields of old wars.",     "power" : 35,     "toughness" : 25,     "speed" : 18,     "energy" : 10,     "monster_types" : "Spectral Cavalry",     "weakness" : "Holy Light",     "immunity" : "Physical Attacks",     "seed" : "Spectral Horseman"     }
 {"description" : "A unique and quirky monster, the Ice Cream Monster Chef whips up a storm of frozen delights with its long ice cream scoops for arms. Be careful not to get caught in its sweet but deadly sundae surprise!",    "power" : 15,    "toughness" : 12,    "speed" : 8,    "energy" : 30,    "monster_types" : "Ice Cream Maker",    "weakness" : "Fire",    "immunity" : "Cold",    "seed" : "Ice Cream Monster Chef"    }
 {"description" : "Vampire Bat Bartender is a nighttime mixologist at the Fang's Tap, a popular bar in Transylvania. He serves up potions and elixirs to travelers passing through. With a quick snap of his fangs, he can refill your health or drain it away.",     "name" : null,     "power" : 15,     "toughness" : 12,     "speed" : 8,     "energy" : 5,     "monster_types" : "Vampire Bat",     "weakness" : "Garlic and Sunlight",     "immunity" : "Poison",     "seed" : "Vampire Bat Bartender"     }
 {"description" : "The Radioactive Scorpion Ranger is a mutated scorpion with advanced tactical skills and the ability to emit radiation. It uses its stinger as both a weapon and a tool for exploration, seeking out valuable resources.",    "power" : 15,    "toughness" : 20,    "speed" : 7,    "energy" : 10,    "monster_types" : "Scorpion",    "weakness" : "Ice",    "immunity" : "Poison",    "seed" : "Radioactive Scorpion Ranger"    }
 {"description" : "The Gnome Blacksmith is a hardworking and skilled craftsman, always ready to forge new weapons or repair old ones. He has a strong affinity for metals and can smith rare alloys.",     "power" : 12,     "toughness" : 8,     "speed" : 6,     "energy" : 5,     "monster_types" : "Gnome",     "weakness" : "Cold",     "seed" : "Gnome Blacksmith"     }
 {"description" : "The Angelic Unicorn Healer is a celestial being that radiates light and healing energy. It uses its horn to heal wounds and restore life to the weary. Its wings carry it swiftly through the skies.",     "name" : "Angelic Unicorn",     "power" : 35,     "toughness" : 28,     "speed" : 40,     "energy" : 50,     "monster_types" : "Unicorn Angel",     "weakness" : "Shadow",     "immunity" : "Poison and Disease",     "seed" : "Angelic Unicorn Healer"    }
 {"description" : "The Lava Goblin Shaman is a fiery and volatile creature from the depths of the Magma Mountains. It has the ability to summon smaller Lava Goblins and cast powerful fire spells.",    "power" : 35,    "toughness" : 25,    "speed" : 40,    "energy" : 20,    "monster_types" : "Goblin",    "weakness" : "Water",    "seed" : "Lava Goblin Shaman"    }
 {"description" : "The Tree Gnome Ranger is a master archer and nature protector, living in harmony with the forest. It has keen senses and can call upon the aid of nearby trees for added protection.",    "power" : 15,    "toughness" : 12,    "speed" : 18,    "energy" : 10,    "monster_types" : "Tree Gnome Ranger",    "weakness" : "Fire",    "seed" : "41. Tree Gnome Ranger"    }
 {"description" : "An Electric Eel with a PhD in marine biology, this Monster can conduct electricity and has advanced knowledge of aquatic life. It's known to use its electrical powers for both defense and research.",    "power" : 35,    "toughness" : 15,    "speed" : 20,    "energy" : 25,    "monster_types" : "Electric Fish Scientist",    "weakness" : "Heat",    "immunity" : "Ice and Cold",    "seed" : "42. Electric Eel Scientist"    }
 {"description" : "The Ghostly Phantom Knight is a spectral being, wielding an ethereal sword and shield. It is said that only the bravest of warriors can see it in its full form, as it often masks itself among the living.",    "name" : null,    "power" : 35,    "toughness" : 12,    "speed" : 28,    "energy" : 15,    "monster_types" : "Ghostly Phantom Knight",    "weakness" : "Holy Light",    "immunity" : "Physical attacks",    "seed" : "Ghostly Phantom Knight"    }
 {"description" : "The Ice Cream Sundae Engineer is a unique and quirky monster with an engineering background. It uses its sundae creations as tools and weapons, creating traps and obstacles for enemies. It can also provide temporary bonuses to nearby allies.",    "power" : 15,    "toughness" : 18,    "speed" : 12,    "energy" : 10,    "monster_types" : "Engineer",    "weakness" : "Fire",    "immunity" : "Cold",    "seed" : "Ice Cream Sundae Engineer"    }
 {"description" : "Robo-Samurai is a master of the ancient art of kempo, but with a modern twist. Fully armored and armed with deadly precision, it's not an opponent to be trifled with.","power" : 50,"toughness" : 35,"speed" : 12,"energy" : 45,"monster_types" : "Robot Samurai","weakness" : "Fire","immunity" : "Poison and Corrosion","seed" : "Robot Samurai"}
 {"description" : "The Alien Plant Master is a strange and otherworldly being, known for its mastery over plant life. It can manipulate plants to grow at an accelerated rate or with unnatural properties. It's a peaceful creature but will defend itself against threats.","power" : 35,"toughness" : 40,"speed" : 10,"energy" : 25,"monster_types" : "Alien Plant","weakness" : "Fire","immunity" : "Cold","seed" : "Alien Plant Master"}
 {"description" : "The Steampunk Griffin Engineer, also known as Greta, is a brilliant inventor and engineer. With the body of a griffin and the mind of an inventor, Greta can construct complex machines on the fly to turn the tide of battle. Her metallic feathers shimmer in the sunlight, reflecting her inner brilliance.", "name" : "Greta", "power" : 35, "toughness" : 45, "speed" : 28, "energy" : 15, "monster_types" : "Steampunk Griffin Engineer", "weakness" : "Sonic Attacks", "immunity" : "Fire", "seed" : "Steampunk Griffin Engineer" }
 {"description" : "The Giant Bear Monk is a massive, powerful and wise creature that roams the forest. It has mastered martial arts and can inflict heavy damage with its paws. Its size and strength make it a formidable opponent.",    "power" : 51,    "toughness" : 60,    "speed" : 3,    "energy" : 20,    "monster_types" : "Bear Monk",    "weakness" : "Fire",    "seed" : "Giant Bear Monk"    }
 {"description" : "The Cybernetic Dragon Knight is a fearsome fusion of dragon and advanced cybernetics. It soars through the skies, wielding a mighty energy sword and protected by its indestructible armor. Its roar is enough to shake mountains.",     "name" : null,     "power" : 75,     "toughness" : 60,     "speed" : 35,     "energy" : 45,     "monster_types" : "Dragon Cyborg Knight",     "weakness" : "Magic",     "immunity" : "Physical Damage",     "seed" : "Cybernetic Dragon Knight"    }
 {"description" : "The Skeletal Necromancer is a master of the dark arts, able to raise undead minions to fight for him. His touch can turn the living into the dead.", "name" : "Necromancer", "power" : 45, "toughness" : 25, "speed" : 15, "energy" : 30, "monster_types" : "Undead Mage", "weakness" : "Holy Damage", "immunity" : "Poison and Toxins", "seed" : "Skeletal Necromancer" }
 {"description" : "The Space Jellyfish Wiz is a cosmic entity with the power to manipulate space and time. It can create portals, teleport itself and others, and cast powerful spells. Its body consists of multiple layers of translucent jelly and it has tentacles that can extend for great distances.", "name" : "Space Jellyfish Wiz", "power" : 100, "toughness" : 85, "speed" : 20, "energy" : 75, "monster_types" : "Space Jellyfish Wizard", "weakness" : "Physical attacks", "immunity" : "Energy based attacks", "seed" : "Space Jellyfish Wizard" }
 {"description" : "The Robot Samurai Commander is a highly advanced and powerful mechanical samurai, leading the army of robotic soldiers in the Castle of Iron Will. He can repair other robots and deal massive damage.",     "power" : 55,     "toughness" : 60,     "speed" : 20,     "energy" : 30,     "monster_types" : "Robot Samurai",     "weakness" : "Nuclear",     "immunity" : "Fire",     "seed" : "Robot Samurai Commander"     }
 {"description" : "The Cave Troll Alchemist is a rare and dangerous variant of the common cave troll. This one has an advanced knowledge of alchemy, using potions and elixirs to enhance its own abilities or hinder those of its enemies.","power" : 45,"toughness" : 60,"speed" : 15,"energy" : 35,"monster_types" : "Cave Troll","weakness" : "Fire","immunity" : "Poison and Toxic Gas","seed" : "Cave Troll Alchemist"}
 {"description" : "The Cybernetic Crab Sage is an ancient and wise crab with advanced technology integrated into its shell. It imparts knowledge of the tides and currents, and can manipulate water for combat or support. It's a guardian of maritime wisdom.", "name" : "Cybernetic Crab Sage", "power" : 32, "toughness" : 59, "speed" : 7, "energy" : 18, "monster_types" : "Crab Cyborg Sage", "weakness" : "Fire", "immunity" : "Plant and Temptation", "seed" : "Cybernetic Crab Sage" }
 {"description" : "The Lava Golem Priestess is a fiery and relentless guardian of the molten depths. It can manipulate lava to attack and defend, and it's a skilled healer with powerful priests spells.", "power" : 85, "toughness" : 90, "speed" : 10, "energy" : 75, "monster_types" : "Lava Golem", "weakness" : "Ice", "immunity" : "Fire and Magma", "seed" : "Lava Golem Priestess" }
 {"description" : "The Mechanical Dragon Engineer is a master craftsman of gears and metal, able to construct intricate machines and repair even the most damaged mechanical beasts. They are neutral in combat but can turn the tide with their inventions.", "power" : 12, "toughness" : 15, "speed" : 8, "energy" : 30, "monster_types" : "Mechanic", "weakness" : "Fire", "immunity" : "Electricity and Poison", "seed" : "Mechanical Dragon Engineer" }
 {"description" : "A highly advanced and deadly Robot Ninja, built for combat and stealth. It's programmed to be relentless in battle and is capable of adapting to new situations.",     "power" : 50,     "toughness" : 32,     "speed" : 17,     "energy" : 15,     "monster_types" : "Robot",     "weakness" : "Fire",     "seed" : "Robot Ninja"     }
 {"description" : "The Ghostly Phantom Summoner is a wraith with the power to summon other spirits and ghosts. Its haunting scream can leave even the bravest adventurers paralyzed with fear.",     "name" : "Ghostly Phantom Summoner",     "power" : 45,     "toughness" : 35,     "speed" : 10,     "energy" : 50,     "monster_types" : "Undead Wraith",     "weakness" : "Banishing",     "immunity" : "Physical Attacks",     "seed" : "Ghostly Phantom Summoner"     }
 {"description" : "The Steampunk Gryphon Engineer is a heavily armored, flying machine of war. With a keen intellect and incredible mechanical prowess, it can repair and build complex machines on the fly. Its gatling gun is its primary weapon, but it also has the ability to breathe fire. It is a rare sight in the world.",     "power" : 85,     "toughness" : 70,     "speed" : 35,     "energy" : 60,     "monster_types" : "Steampunk Gryphon",     "weakness" : "Explosives",     "immunity" : "Poison and Fire",     "name" : "Steampunk Gryphon Engineer",     "seed" : "SteampunkGryphonEngineer"    }
 {"description" : "The Ice Cream Monster - Sundae Healer - is a unique and mysterious creature, capable of healing other monsters with its creamy delights. It moves slowly but steadily, leaving a trail of sweetness behind.",    "power" : 10,    "toughness" : 25,    "speed" : 10,    "energy" : 30,    "monster_types" : "Ice Cream",    "weakness" : "Fire",    "seed" : "Ice Cream Monster Healer"    }
 {"description" : "The Mutated Spider Queen is a grotesque and terrifying spider, with large fangs, multiple eyes, and the ability to shoot webs that can ensnare entire areas. Her venomous bite is lethal to most creatures.", "power" : 75, "toughness" : 90, "speed" : 12, "energy" : 30, "monster_types" : "Spider", "weakness" : "Fire", "immunity" : "Cold", "seed" : "Mutated Spider Queen" }
 {"description" : "The Cybernetic Chimera is a mechanical terror that has evolved from the fusion of multiple creatures. Its body is a combination of cybernetics and biological components, making it a formidable opponent in battle. Its three heads represent its agility, strength, and intelligence.",     "power" : 68,     "toughness" : 55,     "speed" : 45,     "energy" : 20,     "monster_types" : "Cybernetic Chimera",     "weakness" : "Organic Attacks",     "immunity" : "Technology Malfunctions",     "seed" : "Cybernetic Chimera Warrior"    }
 {"description" : "The Robot Knight Commander, model number 69, is a master of battle strategy and leads the robotic army to victory. It has multiple weapons and defensive systems.",    "power" : 50,    "toughness" : 40,    "speed" : 15,    "energy" : 30,    "monster_types" : "Robot",    "weakness" : "Fire",    "seed" : "Robot Knight Commander"}
 {"description" : "The Skeleton Archer Queen is a powerful and commanding skeleton, leading an army of undead archers. She excels in ranged combat and has a high energy reserve to keep her troops firing.", "name" : "Queen of the Bones", "power" : 35, "toughness" : 12, "speed" : 6, "energy" : 40, "monster_types" : "Skeleton Archer Queen", "weakness" : "Fire", "immunity" : "Poison and Disease", "seed" : "Skeleton Archer Queen" }
 {"description" : "The Electric Eel Sage is a mystic eel who can harness the power of electricity from its environment. It uses this ability to stun opponents and heal itself. It's known for its wisdom and knowledge, often providing guidance to other creatures in its waters.", "name" : "Electric Eel Sage", "power" : 35, "toughness" : 15, "speed" : 25, "energy" : 30, "monster_types" : "Sage, Electric Eel", "weakness" : "Fire", "immunity" : "Poison and Paralysis", "seed" : "Electric Eel Sage" }
 {"description" : "The Space Jellyfish Engineer is a mysterious and intelligent being from outer space. It uses its tentacles to construct complex machines and gadgets, making it an essential ally for any adventurer in need of advanced technology. The Engineer's bioluminescent nature makes it a sight to behold in the darkest corners of the universe.", "power" : 35, "toughness" : 18, "speed" : 20, "energy" : 45, "monster_types" : "Space Jellyfish", "weakness" : "Sonic Waves", "immunity" : "Electricity", "seed" : "Space Jellyfish Engineer", "name" : "Engineer" }
 {"description" : "Lava Golem Samurai is a deadly fusion of ancient samurai combat skills and molten lava. With each strike, it leaves a trail of destruction and pain.","name" : null,"power" : 45,"toughness" : 52,"speed" : 13,"energy" : 35,"monster_types" : "Lava Golem Samurai","weakness" : "Ice","immunity" : "Fire","seed" : "73. Lava Golem Samurai"}
 {"description" : "The 75 Starfish Necromancer is a marine necromancer of great power and age. It can control the dead starfish and coral reefs around it, creating complex underwater structures that serve as its lair. It has a powerful grasp and can paralyze prey with a touch.", "name" : "Star Necro", "power" : 50, "toughness" : 60, "speed" : 15, "energy" : 35, "monster_types" : "Necromancer Starfish", "weakness" : "Fire and Bright Light", "immunity" : "Cold", "seed" : "Starfish Necromancer" }
 {"description" : "Robot Samurai Apprentice is a young and eager learner in the art of robot samurai combat. It follows its programming with unwavering dedication, but lacks the experience and finesse of a seasoned warrior.",    "power" : 35,    "toughness" : 25,    "speed" : 17,    "energy" : 20,    "monster_types" : "Robot Samurai",    "weakness" : "Organic Materials",    "immunity" : "Poison and Radiation",    "seed" : "Robot Samurai Apprentice"    }
 {"description" : "A massive, mutated T-Rex with an insatiable hunger for destruction. Its scaled body is covered in rough, scaly skin and its eyes glow with a sinister intelligence.",     "power" : 92,     "toughness" : 135,     "speed" : 60,     "energy" : 75,     "monster_types" : "Dinosaur",     "weakness" : "Freezing temperatures and tranquilizers",     "immunity" : "Fire",     "seed" : "Mutated T-Rex"    }
 {"description" : "The Alien Plant Warrior is a mysterious, sentient plant from another planet. It has the ability to absorb sunlight and convert it into energy, making it a formidable opponent in battle. Its vines can ensnare enemies and its roots can manipulate terrain.",     "power" : 67,     "toughness" : 85,     "speed" : 15,     "energy" : 42,     "monster_types" : "Alien Plant",     "weakness" : "Fire",     "immunity" : "Cold and Poison",     "seed" : "Alien Plant Warrior"    }
 {"description" : "The Ghostly Phantom Ranger is an ethereal and elusive ranger, capable of passing through solid objects and appearing as a mere wisp of mist. He specializes in sneak attacks and has the ability to become invisible at will. His weapon of choice is a spectral crossbow that shoots bolts of raw energy.",    "name" : "Ghostly Phantom Ranger",    "power" : 35,    "toughness" : 18,    "speed" : 42,    "energy" : 30,    "monster_types" : "Ghostly Spectre Ranger",    "weakness" : "Physical attacks",    "immunity" : "Poison and Fear",    "seed" : "Ghostly Phantom Ranger"    }
 {"description" : "The Ice Cream Monster - Professor Brain Freeze - is an obsessed scientist who specializes in creating new and exotic ice cream flavors. He has the ability to manipulate temperature and texture of his own body to create different ice creams on demand.", "power" : 25, "toughness" : 18, "speed" : 15, "energy" : 30, "monster_types" : "Ice Cream Scientist", "weakness" : "Fire", "immunity" : "Heat", "seed" : "81. Ice Cream Monster Scientist" }
 {"description" : "The Cybernetic Dragon Necromancer, codenamed '82', is a powerful undead dragon infused with advanced cybernetics. It has the ability to raise and control an army of undead minions. Its breath weapon consists of toxic energy bolts, and it's immune to most forms of magic.","name" : "82","power" : 100,"toughness" : 95,"speed" : 35,"energy" : 80,"monster_types" : "Cybernetic Dragon Necromancer","weakness" : "Holy Damage","immunity" : "Fire and Magic","seed" : "Cybernetic Dragon Necromancer"}
 {"description" : "An apprentice robot ninja, programmed for stealth and agility. It is still undergoing training and has not yet reached its full potential.",    "power" : 15,    "toughness" : 20,    "speed" : 30,    "energy" : 10,    "monster_types" : "Robot Ninja",    "weakness" : "Fire",    "seed" : "Robot Ninja Apprentice"    }
 {"description" : "The Lava Golem Summoner is a malevolent sorcerer who can summon and control multiple Lava Golems. His power lies in his ability to manipulate lava, creating traps and obstacles for enemies. He is relentless in battle.",     "power" : 65,     "toughness" : 80,     "speed" : 15,     "energy" : 35,     "monster_types" : "Lava Sorcerer",     "weakness" : "Ice",     "immunity" : "Fire",     "summons" : [{"name" : "Lava Golem", "description" : "A hulking, molten creature made of liquid rock and magma. It moves slowly but deals heavy damage to those who approach it.", "power" : 20, "toughness" : 35, "speed" : 10, "energy" : 0}],     "seed" : "Lava Golem Summoner"    }
 {"description" : "The Crystal Golem Healer is a specialized golem that has been imbued with the power of healing and regeneration. It uses its crystalline structure to absorb energy from its surroundings and channel it into healing spells for its allies.", "power" : 25, "toughness" : 80, "speed" : 15, "energy" : 60, "monster_types" : "Crystal Golem", "weakness" : "Fire", "immunity" : "Poison and Paralysis", "healing" : true, "seed" : "Crystal Golem Healer" }
 {"description" : "The Starfish Archers are an unusual and mysterious marine life, armed with sharp-tipped arrows made of calcified coral and seaweed. They have an excellent sense of direction and are known to be skilled marksmen.",     "power" : 15,     "toughness" : 32,     "speed" : 8,     "energy" : 7,     "monster_types" : "Starfish",     "weakness" : "Physical attacks",     "seed" : "Starfish Archer"     }
 {"description" : "The Mechanical Gryphon - Sagacious Scylla - is an ancient and powerful sage who has fused herself with a mechanical gryphon. She is the keeper of knowledge in the Technomancy Tower of Aetheria. She can manipulate machinery and technology, and her keen intellect solves even the most complex problems.", "name" : "Sagacious Scylla", "power" : 105, "toughness" : 87, "speed" : 42, "energy" : 63, "monster_types" : "Mechanical Gryphon Sage", "weakness" : "Organic", "immunity" : "Electromagnetic Pulses and Toxins", "seed" : "87. Mechanical Gryphon Sage" }
 {"description" : "The 88. Robot Samurai Master is a legendary master of the ancient art of robotics and martial arts. It can repair itself in battle and call forth smaller robotic minions to aid it. Its attacks are swift and precise, making it a formidable opponent.", "name" : "Robot Samurai Master", "power" : 88, "toughness" : 95, "speed" : 15, "energy" : 60, "monster_types" : "Robot Samurai", "weakness" : "Ice", "immunity" : "Poison and Electrical Damage", "seed" : "Robot Samurai Master" }
 {"description" : "The Mutated Kraken is a monstrous sea creature that has undergone an unusual mutation, giving it additional power and abilities. It can control the water around it and unleash devastating attacks.", "power" : 100, "toughness" : 95, "speed" : 20, "energy" : 80, "monster_types" : "Kraken", "weakness" : "Thunderbolt", "immunity" : "Poison and Paralysis", "seed" : "Mutated Kraken" }
 {"description" : "The Alien Plant Priestess is an otherworldly being that resembles a giant plant with sentient capabilities. It has the ability to manipulate growth and absorb energy from nearby sources. Its soothing presence can heal allies.",     "power" : 35,     "toughness" : 45,     "speed" : 10,     "energy" : 50,     "monster_types" : "Plant Alien",     "weakness" : "Fire",     "immunity" : "Cold and Darkness",     "seed" : "Alien Plant Priestess"     }
 {"description" : "The Steampunk Manticore - War Machination - is a heavily armored and deadly Steampunk version of the mythical creature, the Manticore. It attacks with its flamethrower tail and steam-powered claws. It is a fearsome sight in battle.", "name" : "War Machination", "power" : 85, "toughness" : 90, "speed" : 15, "energy" : 30, "monster_types" : "Steampunk Manticore", "weakness" : "Ice", "immunity" : "Poison and Temptation", "seed" : "Steampunk Manticore Warrior" }
 {"description" : "The Ghostly Phantom Monk is a spectral entity, shrouded in an ethereal mist. It moves silently and swiftly, striking fear into the hearts of its enemies with just its presence. Its monk training allows it to harness its own energy and channel it into devastating blows.", "name" : "Ghostly Phantom Monk", "power" : 25, "toughness" : 10, "speed" : 30, "energy" : 20, "monster_types" : "Ghostly Spectre Monk", "weakness" : "Physical attacks", "immunity" : "Energy based attacks and Mind Control", "seed" : "Ghostly Phantom Monk" }
 {"description" : "The 93. Ice Cream Monster Knight is a unique and powerful creature, renowned for its sweet demeanor and formidable combat abilities. It wields an ice cream trident and wears a suit of armor made from frozen desserts.","name" : null,"power" : 35,"toughness" : 60,"speed" : 18,"energy" : 25,"monster_types" : "Ice Cream Knight","weakness" : "Fire","immunity" : "Cold","seed" : "93. Ice Cream Monster Knight"}
 {"description" : "The Cybernetic Dragon Ranger, with the code name 'Dragonator', is a legendary cybergised dragon that roams the lands in search of new technologies to add to his repertoire. His powerful breath attack can be customized depending on his latest upgrades.", "name" : "Dragonator", "power" : 105, "toughness" : 90, "speed" : 60, "energy" : 80, "monster_types" : "Cybernetic Dragon", "weakness" : "Ice and Holy", "immunity" : "Fire", "seed" : "Cybernetic Dragon Ranger" }
 {"description" : "The Robot Ninja Master is a highly advanced and deadly mechanical samurai. With superior strength, speed, and agility, this ninja is a force to be reckoned with. Its blades are sharp and its defenses are impenetrable.",     "power" : 50,     "toughness" : 48,     "speed" : 23,     "energy" : 17,     "monster_types" : "Robot Ninja",     "weakness" : "Organic matter",     "immunity" : "Fire",     "seed" : "Robot Ninja Master"    }
 {"description" : "The Lava Golem Archer is a destructive force of nature, wielding a powerful bow and shooting molten rocks from its eyes. It moves slowly but relentlessly towards its target.",     "power" : 50,     "toughness" : 60,     "speed" : 15,     "energy" : 20,     "monster_types" : "Lava Golem",     "weakness" : "Water",     "seed" : "Lava Golem Archer"     }
 {"description" : "The Crystal Golem Summoner is a powerful mage who can summon and control multiple Crystal Golems. They are masters of elemental manipulation, especially water and earth.",     "power" : 35,     "toughness" : 28,     "speed" : 10,     "energy" : 45,     "monster_types" : "Golem Mage",     "weakness" : "Fire",     "immunity" : "Cold and Poison",     "seed" : "Crystal Golem Summoner",     "summoned_creatures" : [{"name" : "Crystal Golem", "power" : 12, "toughness" : 15, "speed" : 3, "energy" : 0, "seed" : "Crystal Golem"},                           {"name" : "Crystal Golem", "power" : 12, "toughness" : 15, "speed" : 3, "energy" : 0, "seed" : "Crystal Golem"},                           {"name" : "Crystal Golem", "power" : 12, "toughness" : 15, "speed" : 3, "energy" : 0, "seed" : "Crystal Golem"}]    }
 {"description" : "The Mechanical Griffon Healer is a rare and advanced mechanical creation, designed for healing and support. It has the ability to repair allies and debuff enemies. Its mechanized wings grant it impressive maneuverability.","name" : null,"power" : 25,"toughness" : 35,"speed" : 28,"energy" : 15,"monster_types" : "Mechanical Griffon","weakness" : "Fire","immunity" : "Poison and Disease","seed" : "Mechanical Griffon Healer"}
 ["Error in input: '100' is not a valid monster name or description.", "Output for valid input would look like:", { "description" : "The Robot Samurai Sage is an ancient and powerful robot with the wisdom of centuries. It is armed with a deadly samurai sword and can impart valuable knowledge to those worthy.", "name" : "Robot Samurai Sage", "power" : 50, "toughness" : 70, "speed" : 10, "energy" : 30, "monster_types" : "Robot Samurai", "weakness" : "Fire", "immunity" : "Mind Control and Temptation", "seed" : "Robot Samurai Sage" }]
 {"description" : "The Mutated Ankylosaurus is a prehistoric beast with an unusual mutation that makes it even more dangerous. Its tail now has a large, sharp spike on the end and its armor plates are thicker and more pronounced.","power" : 72,"toughness" : 90,"speed" : 5,"energy" : 25,"monster_types" : "Ankylosaurus","weakness" : "Fire","seed" : "Mutated Ankylosaurus"}
 {"description" : "The Alien Plant Warrior Queen is a colossal, intelligent and fierce alien plant that rules over its kind. It can manipulate plants to grow thorns, vines or tendrils as weapons, and it has the ability to absorb energy from its surroundings. Its roar is deafening and can knock nearby opponents off their feet.","name" : "Queen Florax","power" : 105,"toughness" : 98,"speed" : 6,"energy" : 85,"monster_types" : "Alien Plant","weakness" : "Fire","immunity" : "Poison and Psychic","seed" : "Alien Plant Warrior Queen"}
 {"description" : "The Steampunk Gryphon Knight is a mechanical wonder, a fusion of gears and feathers. It's a fierce combatant that can soar through the skies or traverse rugged terrain. Its powerful claws can rend steel as easily as it crushes bone.",    "name" : null,    "power" : 85,    "toughness" : 70,    "speed" : 35,    "energy" : 50,    "monster_types" : "Steampunk Gryphon",    "weakness" : "Electricity",    "immunity" : "Poison and Toxic Gas",    "seed" : "Steampunk Gryphon Knight"    }
 {"description" : "The Ghostly Phantom Scientist is a rare and enigmatic creature, half ghost and half scientist. It haunts laboratories and ancient libraries, seeking knowledge and experimentation. Its ethereal touch can disrupt electronic devices and its moans can disrupt mental focus.",     "power" : 12,     "toughness" : 6,     "speed" : 15,     "energy" : 8,     "monster_types" : "Ghost Phantom Scientist",     "weakness" : "Bright Light",     "immunity" : "Physical Damage",     "seed" : "Ghostly Phantom Scientist"     }
 {"description" : "The Cybernetic Dragon Healer is a rare and powerful dragon, infused with advanced technology. It has the ability to heal allies with its powerful beam attacks and can absorb energy from surrounding sources to recharge. It is often found guarding technological sanctums.", "name" : "Cybernetic Healer Dragon", "power" : 90, "toughness" : 85, "speed" : 15, "energy" : 70, "monster_types" : "Dragon Cyborg", "weakness" : "Physical attacks", "immunity" : "Magic", "seed" : "Cybernetic Dragon Healer" }
 {"description" : "A robotic ninja apprentice, fresh from the assembly line and eager to prove itself. It is still learning the ways of the ninja but is already showing great potential.",    "power" : 13,    "toughness" : 9,    "speed" : 15,    "energy" : 6,    "monster_types" : "Robot Ninja",    "weakness" : "Electromagnetic Pulse",    "seed" : "Robot Ninja Apprentice"    }
 {"description" : "The Lava Golem Archer King is a colossal and cunning golem, wielding a deadly bow made from volcanic rock. It can control magma flows and summon smaller lava golems to do its bidding.","name" : "Archer King","power" : 82,"toughness" : 105,"speed" : 6,"energy" : 78,"monster_types" : "Lava Golem Archer","weakness" : "Ice","immunity" : "Fire","seed" : "Lava Golem Archer King"}
 {"description" : "The Crystal Golem Knight Queen is a magnificent and powerful creature made entirely of crystal. She is the queen of all golems and is a formidable warrior, able to wield powerful magic and summon smaller crystalline minions.", "name" : "Crystal Golem Knight Queen", "power" : 150, "toughness" : 200, "speed" : 10, "energy" : 80, "monster_types" : "Crystal Golem Knight", "weakness" : "Ice", "immunity" : "Fire", "seed" : "Crystal Golem Knight Queen" }
 {"description" : "Starfish Samurai Master is a legendary being, an ancient starfish warrior from the depths of the sea. He wields a trident as his primary weapon and can control the tides. He is a wise and respected leader among his kind.", "name" : "Starfish Samurai Master", "power" : 150, "toughness" : 120, "speed" : 10, "energy" : 100, "monster_types" : "Starfish Samurai", "weakness" : "Fire", "immunity" : "Water", "seed" : "Starfish Samurai Master" }
 {"description" : "The Mechanical Gryphon Summoner is a mechanical construct with the ability to summon mechanical gryphons to do its bidding. It is relentless in its pursuit of knowledge and technology.","power" : 50,"toughness" : 45,"speed" : 35,"energy" : 30,"monster_types" : "Construct Mechanical Gryphon","weakness" : "Magic","immunity" : "Fire","seed" : "Mechanical Gryphon Summoner"}
 {"description" : "The 112. Robot Samurai Sage Master is an ancient and wise master of robotics and martial arts. He is a formidable warrior, capable of summoning mechanical samurais to aid him in battle. His sage-like wisdom grants him the ability to manipulate time and space within his vicinity.", "name" : "Robot Samurai Sage Master", "power" : 50, "toughness" : 75, "speed" : 15, "energy" : 45, "monster_types" : "Robot Samurai Sage", "weakness" : "Magic", "immunity" : "Physical attacks", "seed" : "Robot Samurai Sage Master" }
 {"description" : "The Mutated Triceratops is a monstrous beast with three horns, each one mutated to an alarming size and shape. Its body is covered in thick scaly plates and it has a powerful tail, used as a deadly weapon. It's known to be aggressive and territorial.","power" : 87,"toughness" : 125,"speed" : 14,"energy" : 35,"monster_types" : "Triceratops","weakness" : "Ricochet Shot and Freeze Ray","seed" : "Mutated Triceratops"}
 {"description" : "The Steampunk Manticore - Remedy - is a rare healing steampunk manticore, known for its ability to mend and restore damaged machinery and creatures. Its fiery breath can also be used as a powerful healing balm.","name" : "Remedy","power" : 25,"toughness" : 45,"speed" : 18,"energy" : 30,"monster_types" : "Steampunk Manticore Healer","weakness" : "Ice and Magnetic","immunity" : "Poison","seed" : "Steampunk Manticore Healer"}
 {"description" : "The Ghostly Phantom Warrior is a powerful undead entity, shrouded in an ethereal mist. It is said that once a great warrior in life, it now haunts the battlefield, seeking vengeance against those who dare to trespass.", "name" : "Ghostly Phantom Warrior", "power" : 50, "toughness" : 32, "speed" : 15, "energy" : 30, "monster_types" : "Ghostly Spectre Warrior", "weakness" : "Bright Light", "immunity" : "Physical Attacks", "seed" : "Ghostly Phantom Warrior" }
 {"description" : "The number 117 is an enigma, but it has manifested as an Ice Cream Monster Archer. It shoots icy projectiles and can create temporary ice barriers.","power" : 32,"toughness" : 15,"speed" : 25,"energy" : 15,"monster_types" : "Ice Cream Archer","weakness" : "Fire","immunity" : "Cold","seed" : "117. Ice Cream Monster Archer"}
 {"description" : "The Cybernetic Dragon Ranger is a high-tech, genetically enhanced dragon with advanced combat training. Equipped with a plasma cannon and a powerful energy shield, it's ready to bring down any foe. Its cybernetic enhancements also grant it extraordinary speed and agility.",    "name" : "Cybernetic Dragon Ranger",    "power" : 75,    "toughness" : 60,    "speed" : 40,    "energy" : 30,    "monster_types" : "Dragon Cyborg Soldier",    "weakness" : "Ice and Magic attacks",    "immunity" : "Poison and Paralysis",    "seed" : "Cybernetic Dragon Ranger"    }
 {"description" : "The 119th Robot Ninja Apprentice is a skilled warrior in training, specializing in stealth and precision attacks. Its metallic body offers both protection and unique abilities.",     "power" : 15,     "toughness" : 30,     "speed" : 25,     "energy" : 12,     "monster_types" : "Robot Ninja",     "weakness" : "Fire",     "immunity" : "Poison",     "seed" : "Robot Ninja Apprentice"    }
 {"description" : "The Lava Golem Knight is a mighty and relentless warrior made entirely of living lava. Its armor is a thick, viscous, molten substance that makes it nearly impervious to physical attacks. It wields a fiery mace and is immune to fire damage.","power" : 95,"toughness" : 105,"speed" : 7,"energy" : 30,"monster_types" : "Lava Golem","weakness" : "Cold and Water","immunity" : "Fire","seed" : "Lava Golem Knight"}
 {"description" : "The Crystal Golem Summoner Queen is a legendary entity, known for her mastery over the creation and summoning of crystalline constructs. Her presence brings forth an ever-shifting terrain of sparkling mineral formations, which can be harnessed for various purposes.", "name" : "Summoner Queen", "power" : 75, "toughness" : 120, "speed" : 3, "energy" : 60, "monster_types" : "Golem Summoner", "weakness" : "Solar Energy", "immunity" : "Mental and Physical Attacks", "seed" : "Crystal Golem Summoner Queen", "summoned_monsters" : [ { "description" : "A Crystal Golem is a construct made of interconnected crystals, each one containing powerful enchantments. It can be summoned to protect, support, or serve as a barrier.", "power" : 30, "toughness" : 75, "speed" : 2, "energy" : 10, "monster_types" : "Golem", "weakness" : "Solar Energy", "immunity" : "Mental and Physical Attacks" }, { "description" : "A Crystal Sentry is a more aggressive variant of the Crystal Golem. It can be summoned to hunt down and eliminate threats.", "power" : 45, "toughness" : 90, "speed" : 4, "energy" : 15, "monster_types" : "Golem Sentry", "weakness" : "Solar Energy", "immunity" : "Mental and Physical Attacks" }]}
 {"description" : "The Starfish Healer is a unique and mysterious creature from the depths of the ocean. It has the ability to heal other creatures and itself, making it a valuable asset in any environment. Its star-shaped body is covered in small, pulsating stars that glow softly.",    "power" : 12,    "toughness" : 25,    "speed" : 8,    "energy" : 20,    "monster_types" : "Starfish",    "weakness" : "None known",    "immunity" : "Poison and Radiation",    "seed" : "Starfish Healer"    }
 {"description" : "The Mechanical Griffon Archer is a mechanical beast of war, combining the majesty of a griffon with advanced technological capabilities. It rains arrows upon its enemies and has limited flying abilities.","power" : 35,"toughness" : 28,"speed" : 30,"energy" : 15,"monster_types" : "Mechanical Griffon","weakness" : "Ice and Fire","immunity" : "Poison and Toxic Gas","seed" : "Mechanical Griffon Archer"}
 {"description" : "Robot Samurai Apprentice Master is a highly skilled and deadly samurai with advanced robotics engineering. He can repair himself in combat, and his attacks are precise and powerful.",    "power" : 35,    "toughness" : 45,    "speed" : 15,    "energy" : 20,    "monster_types" : "Robot Samurai",    "weakness" : "Fire",    "seed" : "Robot Samurai Apprentice Master"    }
 {"description" : "A mutated Pterodactyl, larger and more menacing than its ancestors. Its wings have grown more powerful and its beak sharper. It is known to swoop down from the sky to attack unwary travelers.","power" : 50,"toughness" : 32,"speed" : 48,"energy" : 12,"monster_types" : "Flying Reptile","weakness" : "Sonic Wave","seed" : "Mutated Pterodactyl"}
 {"description" : "The Alien Plant Commander is a sentient plant that commands an army of lesser alien plants. It has the ability to control other plants and emit a powerful acid. It is a formidable foe in any environment.","power" : 85,"toughness" : 100,"speed" : 5,"energy" : 75,"monster_types" : "Alien Plant","weakness" : "Fire","immunity" : "Poison and Mind Control","seed" : "Alien Plant Commander"}
 {"description" : "The Steampunk Gryphon Queen is a legendary monster, the ruler of all gryphons in this realm. She rides atop a magnificent steampunk gryphon and wields an arsenal of steam-powered weaponry. Her roar can shatter mountains and her eyes can pierce through the darkest nights.","name" : "Steampunk Gryphon Queen","power" : 100,"toughness" : 95,"speed" : 25,"energy" : 30,"monster_types" : "Gryphon","weakness" : "Electricity","immunity" : "Poison","seed" : "Steampunk Gryphon Queen"}
 {"description" : "The Ghostly Phantom Priestess is a spectral being, able to pass through solid objects and manipulate the fabric of reality itself. She is a powerful and enigmatic figure, shrouded in mystery and capable of inflicting fear on her foes.", "name" : "Ghostly Phantom Priestess", "power" : 50, "toughness" : 15, "speed" : 35, "energy" : 25, "monster_types" : "Ghostly Specter", "weakness" : "Physical attacks", "immunity" : "Mental and Magical attacks", "seed" : "128. Ghostly Phantom Priestess" }
 {"description" : "The Robot Ninja Master Apprentice is a mechanical ninja in training, programmed for stealth and combat. It may not yet possess the full abilities of its master, but it is still a formidable foe.",     "power" : 15,     "toughness" : 20,     "speed" : 18,     "energy" : 10,     "monster_types" : "Robot Ninja",     "weakness" : "Organic material",     "immunity" : "Poison and Disease",     "seed" : "Robot Ninja Master Apprentice"     }
 {"description" : "The Lava Golem Healer is a unique and powerful golem made of molten lava. It has the ability to heal other monsters, making it an essential member of any team in battle. Its powerful attacks are fueled by the heat of its molten core.", "power" : 35, "toughness" : 70, "speed" : 4, "energy" : 25, "monster_types" : "Golem", "weakness" : "Ice", "immunity" : "Poison and Disease", "seed" : "Lava Golem Healer" }
 {"description" : "The Crystal Golem Knight Queen is a majestic and powerful creature, made entirely of shimmering crystal. She is the ruler of her kind and leads them in battle. Her crystalline form makes her highly resistant to most attacks, but she can also manipulate her crystals to create powerful shields or offensive weapons.", "name" : "Crystal Golem Knight Queen", "power" : 100, "toughness" : 150, "speed" : 8, "energy" : 20, "monster_types" : "Crystal Golem", "weakness" : "Magic Missile", "immunity" : "Physical attacks", "seed" : "Crystal Golem Knight Queen" }
 {"description" : "The Starfish Summoner is a mysterious and ancient marine creature that has the power to summon other starfish and sea creatures to aid it in battle.","power" : 15,"toughness" : 20,"speed" : 7,"energy" : 10,"monster_types" : "Starfish","weakness" : "None known","immunity" : "Water","seed" : "Starfish Summoner","special_abilities" : ["Summons Starfish and Sea Creatures"]}
 {"description" : "The Mechanical Griffon Archer is a legendary mechanical monster with the grace and power of a griffon. It wields powerful long range attacks, making it a formidable opponent from a distance.", "name" : "Mechanical Griffon Archers", "power" : 50, "toughness" : 35, "speed" : 25, "energy" : 15, "monster_types" : "Griffon Mechanical", "weakness" : "Fire", "immunity" : "Poison and Paralysis", "seed" : "Mechanical Griffon Archer" }
 {"description" : "Robot Samurai Sage Apprentice is a mechanical warrior undergoing training in the ancient art of wisdom and enlightenment. It wields a sword that can shoot energy beams, and its advanced sensors allow it to analyze battlefield data in real time.",    "power" : 25,    "toughness" : 30,    "speed" : 15,    "energy" : 18,    "monster_types" : "Robot Samurai Sage",    "weakness" : "Organic Matter",    "immunity" : "Mental Manipulation and Mind Control",    "seed" : "Robot Samurai Sage Apprentice"    }
 {"description" : "The Steampunk Manticore - Sage Master - is a wise and ancient creature, known for its exceptional knowledge of the arcane arts. It possesses a powerful stinger that can deliver devastating damage and has the ability to fly over long distances. Its body is covered in intricate steam-powered gears and mechanisms.", "name" : "Sage Master", "power" : 50, "toughness" : 35, "speed" : 25, "energy" : 30, "monster_types" : "Steampunk Manticore", "weakness" : "Ice", "immunity" : "Fire", "seed" : "139. Steampunk Manticore Sage Master"}
 {"description" : "The Ghostly Phantom Necromancer is a powerful and elusive undead necromancer, capable of summoning spirits and raising the dead to do its bidding. It can drain life energy from living beings.","name" : "Ghostly Phantom Necromancer","power" : 50,"toughness" : 30,"speed" : 15,"energy" : 25,"monster_types" : ["Undead", "Necromancer"],"weakness" : "Holy Magic","immunity" : "Physical Attacks","seed" : "Ghostly Phantom Necromancer"}
 {"description" : "The Cybernetic Dragon Archer is a legendary dragon infused with advanced technology. It has the ability to shoot laser beams from its eyes and breathe fire, making it a formidable opponent. Its cybernetic enhancements make it resilient against most forms of damage.","name" : "Cybernetic Dragon Archer","power" : 85,"toughness" : 70,"speed" : 15,"energy" : 60,"monster_types" : "Dragon Cyborg","weakness" : "Ice","immunity" : "Poison and Magnetic","seed" : "Cybernetic Dragon Archer"}
 {"description" : "The Lava Golem - Dr. Magma - is a scientific genius who has mastered the art of manipulating molten rock and lava. He can construct complex golems on the fly to assist him in battle. His creations are fiercely loyal and relentless.",     "power" : 85,     "toughness" : 90,     "speed" : 5,     "energy" : 75,     "monster_types" : "Lava Golem",     "weakness" : "Water and Ice",     "seed" : "144. Lava Golem Scientist"    }
 {"description" : "The Crystal Golem Summoner King is a legendary summoner who can call forth powerful crystal golems to do his bidding. With immense magical power, he is a formidable foe in battle.", "name" : "Summoner King", "power" : 85, "toughness" : 70, "speed" : 15, "energy" : 60, "monster_types" : "Crystal Golem Summoner", "weakness" : "Ice", "immunity" : "Physical attacks", "seed" : "Crystal Golem Summoner King", "summoned_creatures" : [{"type" : "Crystal Golem", "description" : "A powerful crystal golem summoned by the Summoner King. It can absorb sunlight and store energy in its crystalline structure.", "power" : 35, "toughness" : 40, "speed" : 12, "energy" : 20}, {"type" : "Crystal Golem", "description" : "Another powerful crystal golem summoned by the Summoner King. It can create constructs out of crystal.", "power" : 35, "toughness" : 40, "speed" : 12, "energy" : 20}] }
 {"description" : "The Starfish Queen, a celestial being of the interstellar sea, is a powerful healer and protector of all starfish life. She has the ability to absorb energy from her surroundings and heal any damage done to nearby creatures.", "name" : "Starfish Healer Queen", "power" : 100, "toughness" : 75, "speed" : 1, "energy" : 150, "monster_types" : "Starfish", "weakness" : "None", "immunity" : "Radiation and Poison", "seed" : "Starfish Healer Queen" }
 {"description" : "Mechanical Griffon Knight - 147 is a rare and powerful fusion of engineering and nature, combining the grace and might of a griffon with the mechanical precision of a knight. Its body is composed of intricate gears and metallic plates, yet it retains its majestic wings and sharp talons.", "power" : 65, "toughness" : 72, "speed" : 18, "energy" : 30, "monster_types" : "Griffon Mechanized", "weakness" : "Ice", "immunity" : "Fire", "seed" : "Mechanical Griffon Knight", "legendary" : true }
 {"description" : "The Robot Samurai Sage Master Apprentice is a skilled warrior in training, with advanced programming and combat abilities. Its armor is a work in progress but already effective in battle.", "power" : 12, "toughness" : 18, "speed" : 9, "energy" : 5, "monster_types" : "Robot Samurai", "weakness" : "Necromancy", "immunity" : "Poison and Fire", "seed" : "Robot Samurai Sage Master Apprentice" }
 {"description" : "The Mutated Basilisk is a grotesque and terrifying creature, born from the toxic wastes. It has the ability to petrify its prey with its gaze and regrow limbs that have been severed. Its body is covered in wart-like growths and its eyes glow with an unnatural light.", "power" : 35, "toughness" : 70, "speed" : 21, "energy" : 18, "monster_types" : "Serpent", "weakness" : "Light Magic", "immunity" : "Poison and Venom", "seed" : "Mutated Basilisk" }
 {"description" : "An alien plant with the ability to manipulate and control the elements, it grows in unique extraterrestrial environments and is known to possess a deep understanding of the natural world around it.",    "power" : 35,    "toughness" : 40,    "speed" : 7,    "energy" : 28,    "monster_types" : "Alien Plant",    "weakness" : "Fire",    "immunity" : "Poison and Paralysis",    "seed" : "150. Alien Plant Elementalist"    }
 {"description" : "The Ghostly Phantom Monk Master is a spectral monk who has mastered the art of haunting his enemies. He can pass through solid objects and manipulate the energy around him to create illusions and project terrifying apparitions.", "name" : "Ghostly Phantom Monk Master", "power" : 15, "toughness" : 7, "speed" : 20, "energy" : 18, "monster_types" : "Ghostly Phantom Monk", "weakness" : "Physical Attacks", "immunity" : "Mind Control and Temptation", "seed" : "Ghostly Phantom Monk Master" }
 {"description" : "A mysterious and ancient Ice Cream Monster Sage, said to have been created from the frozen tears of a long-forgotten deity. It is said that this being grants wisdom and knowledge to those who partake in its sweet, creamy essence.", "power" : 15, "toughness" : 20, "speed" : 10, "energy" : 30, "monster_types" : "Ice Cream Sage", "weakness" : "Fire", "immunity" : "Cold", "seed" : "Ice Cream Monster Sage" }
 {"description" : "The Cybernetic Dragon Archer Queen is a technological marvel - an ancient and powerful dragon that has been cybernetically enhanced, able to shoot energy arrows with deadly accuracy from its mechanical eyes.","name" : "Cybernetic Dragon Archer Queen","power" : 75,"toughness" : 60,"speed" : 15,"energy" : 25,"monster_types" : "Dragon Cybernetic","weakness" : "Sacred Light","immunity" : "Poison and Toxic Gas","seed" : "Cybernetic Dragon Archer Queen"}
 {"description" : "The Lava Golem Archer King is a towering, molten monstrosity with an innate sense of archery. Its arrows are made of solidified lava that can melt through even the toughest defenses. Be wary, for this golem's attacks are both ranged and melee.", "power" : 50, "toughness" : 70, "speed" : 10, "energy" : 30, "monster_types" : "Golem Lava", "weakness" : "Ice", "immunity" : "Fire", "seed" : "Lava Golem Archer King", "ranged_attack" : true }
 {"description" : "The Crystal Golem Healer Queen is a powerful healer and leader of her kind, made entirely of crystal. She can repair and heal nearby structures and creatures with great efficiency.", "name" : "Healer Queen", "power" : 157, "toughness" : 200, "speed" : 8, "energy" : 50, "monster_types" : "Crystal Golem", "weakness" : "Dark Magic", "immunity" : "Physical Damage", "seed" : "Crystal Golem Healer Queen" }
 {"description" : "The Starfish Warrior is a unique marine creature with the ability to harden its star-shaped limbs into formidable weapons. It's often found in large numbers on coral reefs, defending their territories from intruders.",    "power" : 15,    "toughness" : 25,    "speed" : 5,    "energy" : 5,    "monster_types" : "Starfish",    "weakness" : "High Temperature",    "seed" : "Starfish Warrior"    }
 {"description" : "The Mechanical Griffon Sage is an ancient and wise construct, infused with the essence of a griffon. It has advanced knowledge in various fields and can analyze complex situations quickly. Its mechanical parts enhance its abilities and make it more durable than its organic counterparts. ", "name" : "Mechanical Griffon Sage", "power" : 50, "toughness" : 45, "speed" : 18, "energy" : 25, "monster_types" : "Griffon Construct", "weakness" : "Magic", "immunity" : "Poison and Physical Damage", "seed" : "Mechanical Griffon Sage" }
 {"description" : "The 160 Robot Samurai Master Apprentice is a skilled and dedicated trainee in the ways of the robotic samurai, learning to perfect its combat techniques. It may one day become a formidable foe.",    "power" : 15,    "toughness" : 20,    "speed" : 13,    "energy" : 7,    "monster_types" : "Robot Samurai",    "weakness" : "Electromagnetic Pulse",    "seed" : "Robot Samurai Master Apprentice"    }
 {"description" : "The Mutated T-Rex Ranger is a fearsome dinosaur with advanced intelligence and survival skills, trained by humans to protect the forest from poachers and other threats. Its mutations grant it unique abilities and increased strength.","power" : 120,"toughness" : 95,"speed" : 18,"energy" : 60,"monster_types" : "Mutated T-Rex","weakness" : "Cold","immunity" : "Poison and Radiation","seed" : "Mutated T-Rex Ranger"}
 {"description" : "The Alien Plant Archdruid is a powerful and ancient being from a far-off planet. It is covered in vibrant, glowing vines and has the ability to manipulate plant growth and control the minds of nearby flora. Its presence can make surrounding areas fertile and lush.","power" : 45,"toughness" : 75,"speed" : 10,"energy" : 35,"monster_types" : "Alien Plant","weakness" : "Fire","immunity" : "Poison and Mind Control","seed" : "Alien Plant Archdruid"}
 {"description" : "The Steampunk Manticore Queen is a legendary healer, with advanced steampunk technology integrated into her body. She can mend wounds and restore energy to allies within a large area of effect. Her sting attack, while deadly, can also heal the queen.","name" : "Steampunk Manticore Healer Queen","power" : 50,"toughness" : 75,"speed" : 18,"energy" : 30,"monster_types" : "Steampunk Manticore","weakness" : "Ice","immunity" : "Fire and Poison","seed" : "Steampunk Manticore Healer Queen"}
 {"description" : "The Ghostly Phantom Knight is a spectral being, clad in the armor of a long-departed knight. It haunts battlefields and ancient ruins, seeking vengeance for past wrongs or simply to add to its collection of spectral trophies. This monster can pass through walls and inflicts fear on its victims.",     "name" : null,     "power" : 25,     "toughness" : 10,     "speed" : 30,     "energy" : 15,     "monster_types" : "Ghostly Phantom Knight",     "weakness" : "Bright Light",     "seed" : "Ghostly Phantom Knight"     }
 {"description" : "The Sage King of Ice Cream is a legendary and ancient being, said to have been born from the frozen depths of the North Pole. With his vast knowledge of the frozen world and the power to create and manipulate ice cream, he is a force to be reckoned with.", "name" : "Sage King", "power" : 35, "toughness" : 40, "speed" : 18, "energy" : 25, "monster_types" : "Ice Cream Sage King", "weakness" : "Fire", "immunity" : "Heat and Cold", "seed" : "Ice Cream Monster Sage King" }
 {"description" : "The Cybernetic Dragon Warrior is a powerful and advanced cyborg dragon, created by the greatest minds of the technological age. Equipped with laser eyes, plasma breath, and heavy armor plating, it is a formidable opponent in battle.",    "power" : 100,    "toughness" : 95,    "speed" : 6,    "energy" : 50,    "monster_types" : "Dragon Cybernetic",    "weakness" : "Ice",    "immunity" : "Fire and Poison",    "seed" : "Cybernetic Dragon Warrior"    }
 {"description" : "The 167th Robot Ninja Apprentice, a work in progress, shows glimmers of potential as it hones its combat skills under the watchful eye of its master. Its steel frame houses advanced circuitry and weaponry.",    "power" : 10,    "toughness" : 25,    "speed" : 6,    "energy" : 8,    "monster_types" : "Robot",    "weakness" : "Magic",    "seed" : "Robot Ninja Master Apprentice"    }
 {"description" : "The Lava Golem Archer Master is a fierce and skilled archer, armed with the powerful magic of molten lava. It's relentless in its pursuit of enemies and can unleash devastating arrows coated in scorching magma.",    "power" : 35,    "toughness" : 60,    "speed" : 12,    "energy" : 18,    "monster_types" : "Golem Lava Archers",    "weakness" : "Water",    "immunity" : "Fire",    "seed" : "Lava Golem Archer Master"    }
 {"description" : "The Crystal Golem Summoner Queen Apprentice is a young and eager mage in training, specializing in the summoning of crystal golems. She can conjure multiple golems at once, and each golem is imbued with her magical power.","name" : null,"power" : 35,"toughness" : 25,"speed" : 15,"energy" : 45,"monster_types" : "Summoner Mage","weakness" : "Fire","summoned_creature" : [{"name" : "Crystal Golem","power" : 10,"toughness" : 25,"speed" : 5,"energy" : 10,"monster_types" : "Golem"}],"seed" : "Crystal Golem Summoner Queen Apprentice"}
 {"description" : "The Mechanical Griffon Healer Apprentice is a young and eager mechanic in training to become a healer for mechanical griffons. While it may not have the full healing abilities of an adult, it still has a bit of a bite and can inflict damage with its metallic claws.",     "power" : 12,     "toughness" : 15,     "speed" : 9,     "energy" : 8,     "monster_types" : "Mechanical Griffon",     "weakness" : "Fire",     "immunity" : "Poison and Disease",     "seed" : "Mechanical Griffon Healer Apprentice"    }
 {"description" : "The 172nd model Robot Samurai Sage Apprentice is a work in progress, with advanced programming and combat training. It may still be learning the ways of the wise and the warrior's code.", "power" : 15, "toughness" : 30, "speed" : 7, "energy" : 12, "monster_types" : "Robot Samurai Sage Apprentice", "weakness" : "Magic", "immunity" : "Poison and Physical Damage below 10 units", "seed" : "Robot Samurai Sage Apprentice" }
 {"description" : "The Mutated Amphibian is a result of an unfortunate experiment gone wrong. It has the agility and adaptability of an amphibian, but with a dangerous mutation that grants it increased power and unpredictable abilities.","power" : 15,"toughness" : 8,"speed" : 10,"energy" : 7,"monster_types" : "Amphibian","weakness" : "Solar Energy","seed" : "Mutated Amphibian"}
 {"description" : "The Alien Plant Summoner is a strange and exotic entity from another world. It has the ability to summon various plants as minions to aid it in battle. Its own abilities are rooted in manipulation of plant life.", "power" : 35, "toughness" : 25, "speed" : 15, "energy" : 20, "monster_types" : "Alien Plant", "weakness" : "Fire", "immunity" : "Poison", "seed" : "Alien Plant Summoner" }
 {"description" : "The Steampunk Gryphon Archer is a mechanical marvel of avian and feline origin. Equipped with advanced gadgets and weapons, it excels in long-range combat. Its cunning mind is always seeking new inventions to add to its arsenal.",     "name" : null,     "power" : 35,     "toughness" : 25,     "speed" : 18,     "energy" : 30,     "monster_types" : "Steampunk Gryphon",     "weakness" : "Fire",     "immunity" : "Poison and Electricity",     "seed" : "Steampunk Gryphon Archer"     }
 {"description" : "The 176th Monster is the Ghostly Phantom Warrior Queen - a regal and formidable specter, clad in armor, who leads her ghostly warrior horde into battle. She can inflict fear upon her enemies and wields powerful energy blasts.","name" : "Ghostly Phantom Warrior Queen","power" : 98,"toughness" : 76,"speed" : 15,"energy" : 45,"monster_types" : "Ghostly Specter","weakness" : "Physical attacks","immunity" : "Holy","seed" : "Ghostly Phantom Warrior Queen"}
 {"description" : "A strange scientist creating bizarre ice cream monsters in a secret laboratory.", "power" : 15, "toughness" : 12, "speed" : 8, "energy" : 10, "monster_types" : "Ice Cream", "weakness" : "Fire", "immunity" : "Cold", "seed" : "Ice Cream Monster Scientist" }
 {"description" : "Robot Ninja Sage is a highly advanced artificial intelligence with the abilities of a ninja and a sage. It can manipulate energy and has unmatched combat skills. Its programming allows it to learn quickly from its surroundings.","name" : "Robot Ninja Sage","power" : 85,"toughness" : 90,"speed" : 20,"energy" : 60,"monster_types" : "Robot Ninja","weakness" : "Organic Matter","immunity" : "Magic and Poison","seed" : "179. Robot Ninja Sage"}
 {"description" : "The Lava Golem Healer King is a towering, molten colossus that wields the power of life and healing over lava. It can manipulate its own form to better defend or attack allies and enemies alike.", "name" : "Healer King", "power" : 105, "toughness" : 120, "speed" : 8, "energy" : 60, "monster_types" : "Lava Golem Healer", "weakness" : "Cold and Electricity", "immunity" : "Fire", "seed" : "180. Lava Golem Healer King" }
 {"description" : "The Crystal Golem Archer is a rare and powerful golem constructed from precious crystals. It wields a bow made of solid crystal and possesses the ability to infuse its arrows with magical energy, making each shot more potent than the last.",     "power" : 50,     "toughness" : 75,     "speed" : 15,     "energy" : 30,     "monster_types" : "Golem",     "weakness" : "Fire",     "seed" : "Crystal Golem Archer"     }
 {"description" : "The Starfish Queen is a legendary warrior queen among her kind, known for her strategic combat skills and her ability to call upon the power of the tides. Her starfish soldiers follow her lead with unwavering loyalty.", "name" : "Starfish Queen", "power" : 105, "toughness" : 72, "speed" : 8, "energy" : 60, "monster_types" : "Starfish", "weakness" : "Fire", "immunity" : "Water", "seed" : "Starfish Warrior Queen" }
 {"description" : "The Robot Samurai Apprentice is a mechanical warrior in training, mastering the ancient art of samurai combat. It may lack emotion but makes up for it with raw power and unyielding dedication.",    "power" : 25,    "toughness" : 18,    "speed" : 9,    "energy" : 10,    "monster_types" : "Robot Samurai",    "weakness" : "Organic Matter",    "seed" : "Robot Samurai Apprentice"    }
 {"description" : "The Mutated Mosasaurus is a monstrously large and mutated version of the classic prehistoric sea monster. With powerful jaws and an uncanny ability to adapt to its environment, it poses a great threat to any seafaring adventurer.",     "power" : 75,     "toughness" : 80,     "speed" : 35,     "energy" : 25,     "monster_types" : "Mutated Sea Monster",     "weakness" : "Bombs and Sonar",     "immunity" : "Freeze",     "seed" : "Mutated Mosasaurus"     }
 {"description" : "The Alien Plant Champion is a sentient and powerful plant from another planet, with the ability to manipulate its cells to release potent toxins or grow vines rapidly. It is the leader of its kind in this dimension.","power" : 50,"toughness" : 75,"speed" : 15,"energy" : 30,"monster_types" : "Alien Plant","weakness" : "Fire","seed" : "Alien Plant Champion"}
 {"description" : "The Steampunk Manticore Healer Apprentice is a mechanical marvel of bio-engineering and steam-powered technology. It's a young apprentice in the art of healing, with a keen interest in mending and patching up its brethren. It may look fierce but deep down it has a compassionate heart.","power" : 15,"toughness" : 20,"speed" : 14,"energy" : 10,"monster_types" : "Steampunk Manticore","weakness" : "Ice","immunity" : "Fire","seed" : "Steampunk Manticore Healer Apprentice"}
 {"description" : "The 188th Ghostly Phantom Necromancer Queen is a fearsome and powerful being, able to command the dead and manipulate spirits. She is the ruler of the spectral realm and can summon an army of undead minions at will.", "name" : "Ghostly Phantom Necromancer Queen", "power" : 100, "toughness" : 75, "speed" : 15, "energy" : 60, "monster_types" : ["Ghost", "Necromancer"], "weakness" : "Holy Light", "immunity" : "Death", "seed" : "Ghostly Phantom Necromancer Queen"}
 {"description" : "The Ice Cream Monster Archer Master is a unique and powerful enemy, known for its deadly accuracy with icy projectiles. It's covered in various flavors of ice cream that can be licked off for temporary health boosts.",     "power" : 25,     "toughness" : 14,     "speed" : 35,     "energy" : 18,     "monster_types" : "Ice Cream Archer",     "weakness" : "Fire",     "seed" : "Ice Cream Monster Archer Master"     }
 {"description" : "The Cybernetic Dragon - Sage Master - is a master of ancient dragon knowledge and cybernetics, combining the power of magic and technology. It's a rare sight to see such a creature in the modern age.","name" : null,"power" : 250,"toughness" : 150,"speed" : 50,"energy" : 150,"monster_types" : "Dragon Cybernetic","weakness" : "Force","immunity" : "Poison and Psychic","seed" : "Cybernetic Dragon Sage Master"}
 {"description" : "The number 191 is an advanced Robot Ninja Master Knight. It's a complex machine of deadly precision and unparalleled combat abilities. Its primary function is to protect and serve, but it can also reprogram other robots.",    "power" : 75,    "toughness" : 90,    "speed" : 6,    "energy" : 35,    "monster_types" : "Robot Ninja Knight",    "weakness" : "Organic Matter",    "immunity" : "Electromagnetic Pulses",    "seed" : "191. Robot Ninja Master Knight"    }
 {"description" : "The Lava Golem - Magma Marauder - is a fierce warrior made entirely of molten rock, leaving trails of destruction in its wake. It can absorb and redirect heat attacks.",    "power" : 45,    "toughness" : 60,    "speed" : 15,    "energy" : 30,    "monster_types" : "Lava Golem",    "weakness" : "Ice",    "seed" : "192. Lava Golem Warrior"    }
 {"description" : "The Crystal Golem Healer Apprentice is a work in progress, learning the art of healing under the guidance of its master. It has the ability to regenerate health and can heal other creatures with touch.","power" : 15,"toughness" : 25,"speed" : 8,"energy" : 10,"monster_types" : "Crystal Golem","weakness" : "Darkness","immunity" : "Poison and Fire","seed" : "Crystal Golem Healer Apprentice"}
 {"description" : "The Starfish Summoner Queen is a legendary aquatic monarch, responsible for the summoning and command of an army of starfish. She is a powerful caster and healer, with a mystical connection to the ocean and its inhabitants.","name" : "Starfish Summoner Queen","power" : 75,"toughness" : 60,"speed" : 15,"energy" : 50,"monster_types" : "Starfish Queen","weakness" : "None known","immunity" : "Poison and Psychic attacks","seed" : "Starfish Summoner Queen"}
 {"description" : "The Mechanical Griffon - Archer Master - is a mechanical beast with the agility and power of a griffon, but enhanced with advanced archery skills. It is often used for long-range reconnaissance and hunting.", "power" : 45, "toughness" : 30, "speed" : 25, "energy" : 15, "monster_types" : "Mechanical Griffon", "weakness" : "Poison", "immunity" : "Fire and Electricity", "seed" : "Mechanical Griffon Archer Master" }
 {"description" : "A Robot Samurai Sage Apprentice Knight is a technological marvel of intricate design and deadly efficiency. This apprentice knight is still in the process of being trained, but it's already displaying impressive combat abilities and a deep understanding of ancient samurai wisdom.", "power" : 35, "toughness" : 40, "speed" : 18, "energy" : 25, "monster_types" : "Robot Samurai Sage Apprentice", "weakness" : "Magic", "immunity" : "Poison and Bleeding", "seed" : "Robot Samurai Sage Apprentice Knight" }
 {"description" : "This is a Mutated Apatosaurus, a monstrously large and mutated version of the classic Apatosaurus dinosaur. With larger than average size, this monster has developed unique abilities that make it a formidable foe.","power" : 75,"toughness" : 90,"speed" : 12,"energy" : 35,"monster_types" : "Dinosaur","weakness" : "Ice","immunity" : "Fire","seed" : "Mutated Apatosaurus"}
 {"description" : "The Alien Plant Archdruidess is a powerful and ancient plant lifeform from the far reaches of space, acting as the high priestess of her kind's communal hive mind. She can manipulate other plants, create complex ecosystems, and possesses powerful healing abilities.","name" : "Alien Plant Archdruidess","power" : 75,"toughness" : 90,"speed" : 15,"energy" : 60,"monster_types" : "Alien Plant","weakness" : "Fire","immunity" : "Poison and Disease","seed" : "Alien Plant Archdruidess"}
 {"description" : "The Steampunk Gryphon Summoner Queen is a powerful and enigmatic monarch, known for her ability to summon and command gryphons. She wields advanced steam technology, making her a formidable adversary in battle.","name" : "Queen Victoria Gryphonforge","power" : 75,"toughness" : 60,"speed" : 20,"energy" : 50,"monster_types" : "Steampunk Gryphon Queen","weakness" : "Ice","immunity" : "Fire","seed" : "Steampunk Gryphon Summoner Queen"}
 ["Error in input format.", {"description" : "The Ghostly Phantom Monk Masters are a duo of powerful spectral monks, able to pass through solid objects and deal heavy damage with their ethereal fists. They can also temporarily manipulate the energy of other monsters. Each Master has its own unique name and appearance.", "power" : 35, "toughness" : 10, "speed" : 30, "energy" : 25, "monster_types" : "Ghostly Monk", "weakness" : "Physical attacks", "seed" : "Ghostly Phantom Monk Masters" }]
